# BuiltInFailures.FabricAreaFailures Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuiltInFailures..::..FabricAreaFailures Members
BuiltInFailures..::..FabricAreaFailures Class Properties See Also
---
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures..::..FabricAreaFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FabricAreaLapSplicesIncorrect | Fabric Area lap splice is incorrect. |
| FabricAreaOutSideOfHost | Fabric Area is sketched completely outside of its host. |

# See Also
BuiltInFailures..::..FabricAreaFailures Class
Autodesk.Revit.DB Namespace